{
  "loading": "Loading",
  "enter": "Enter",
  "role": "Role",
  "agency": "Agency",
  "completed": "Completed",
  "riconoscimenti": "Awards",
  "close": "Close",
  "close project": "Close this project",
  "go to project": "Go to",
  "intro": {
    "p1": {
      "l1": "In the realm of cybersecurity and blockchain,",
      "l2": "innovation safeguards our digital assets"
    },
    "p2": {
      "l1": "As a Creative Technologist,",
      "l2": "I merge research and creativity to redefine trust in the digital frontier."
    },
    "p3": {
      "l1": "Cybersecurity and Blockchain Strategist"
    },
    "p4": {
      "l1": "Aditya Aravind."
    },
    "scroll_cta": {
      "line1": "Scroll down",
      "line2": "to see some work"
    }
  },
  "portfolio": {
    "intro": [
      "I craft cutting-edge",
      "cybersecurity solutions<br />blockchain and Web3 solutions.",
      "From penetration testing to implementing robust incident response plans, I leverage blockchain for enhanced security and immutability. With expertise in secure coding, threat modeling, and blockchain integration",
      "I ensure the resilience of systems against advanced persistent threats."
    ],
    "portfolio": [
      "Projects",
      "I have worked on cybersecurity and blockchain projects such as: <strong>IDA</strong>, <strong>Cyber Threats</strong>, <strong>Gas Token Concept</strong>, <strong>IRM</strong>, <strong>Generali</strong>, <strong>Corner</strong>, <strong>AMDL Circle</strong>.<br /><br />",
      "Here are some of my most relevant projects.(PLEASE RELOAD PROJECT PAGES IF YOU CANT SEE THEM)."
    ]
  },
  "about": {
    "intro": [
      "I was born in <ImageVenice>Khammam, India</ImageVenice> in october 98, today I live in Saint Louis, MO and a recent graduate student from M.S. in Cyber/Electronic operations and warfare from <ImageSketchin>SLU</ImageSketchin>",
      ".",
      "Since then I have been designing and implementing cybersecurity, blockchain applications. I have studied different programming languages and databases to cover the whole stack."
    
    ],
    "clan_title": ["Full Stack Security", "Developer"],
    "clan": [
      "Led a major enhancement project for a leading British energy website, improving user experience by 30%, site performance by 25%, and bolstering security measures. ",
      "Developed and optimized the website's front-end and back-end using a wide array of technologies, resulting in a 20% increase in site traffic and a 15% increase in user retention rate.",
      "Implemented secure coding practices, successfully mitigating potential cyber threats, including code injection attacks and data breaches.",
      "Leveraged knowledge of cybersecurity frameworks such as NIST, ISO, CIS, and SOC 2, enhancing the security posture of the website."
    ],
    "method_title": "Method<br /><pre>&</pre>Acknowledgements",
    "method": [
      "Reduced critical vulnerabilities by 45% through comprehensive penetration testing and remediation.",
      "I leverage Agile methodologies and promote continuous improvement through ongoing research, collaboration, and upskilling.<br />and methodical improvement<br />for myself and others",
      "Decreased incident response time by 35% via automation and <br /> orchestration.",
      "Developed successful blockchain solutions, including a Proof of Concept for Gas Tokens and an NFT Marketplace."

    ]
  },
  "contact": {
    "intro": "You can get in touch with me by writing to",
    "social_intro": "You can find me on LinkedIn"
  }
}
